hedrickbt/TempSensor/Packages/.cache/Keil.STM32F4xx_DFP.2.8.0.pdsc
        <!-- *************************  Device 'STM32F469AE'  ***************************** -->
        <device Dname="STM32F469AE">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469AEHx"> <feature type="BGA" n="168"/> </variant>
          <variant Dvariant="STM32F469AEYx"> <feature type="CSP" n="168"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469AI'  ***************************** -->
        <device Dname="STM32F469AI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469AIHx"> <feature type="BGA" n="168"/> </variant>
          <variant Dvariant="STM32F469AIYx"> <feature type="CSP" n="168"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469IE'  ***************************** -->
        <device Dname="STM32F469IE">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469IETx"> <feature type="QFP" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469IG'  ***************************** -->
        <device Dname="STM32F469IG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469IGTx"> <feature type="QFP" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469II'  ***************************** -->
        <device Dname="STM32F469II">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469IITx"> <feature type="QFP" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469BE'  ***************************** -->
        <device Dname="STM32F469BE">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469BETx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469BG'  ***************************** -->
        <device Dname="STM32F469BG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469BGTx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469BI'  ***************************** -->
        <device Dname="STM32F469BI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469BITx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469NE'  ***************************** -->
        <device Dname="STM32F469NE">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x80000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_512.FLM"         start="0x08000000"  size="0x80000"                  default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469NEHx"> <feature type="BGA" n="216"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469NG'  ***************************** -->
        <device Dname="STM32F469NG">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x100000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_1024.FLM"        start="0x08000000"  size="0x100000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469NGHx"> <feature type="BGA" n="216"/> </variant>
        </device>

        <!-- *************************  Device 'STM32F469NI'  ***************************** -->
        <device Dname="STM32F469NI">
          <memory     id="IROM1"                                   start="0x08000000"  size="0x200000"   startup="1"   default="1"/>
          <memory     id="IRAM1"                                   start="0x20000000"  size="0x50000"    init   ="0"   default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F4xx_2048.FLM"        start="0x08000000"  size="0x200000"                 default="1"/>
          <algorithm  name="CMSIS/Flash/STM32F469_Quad_SPI.FLM"    start="0x90000000"  size="0x2000000"                default="1"/>
          <variant Dvariant="STM32F469NIHx"> <feature type="BGA" n="216"/> </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F479'  **************************** -->
      <subFamily DsubFamily="STM32F479">
        <processor Dclock="180000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F4xx/Include/stm32f4xx.h"  define="STM32F479xx"/>
        <debug svd="CMSIS/SVD/STM32F46_79x.svd"/>
        <debugvars configfile="CMSIS/Debug/STM32F40x_41x_42x_43x.dbgconf">
          // Debug Access Variables, can be modified by user via copy of STM32F401xBCDE_411xCE.dbgconf created by uVision.
          __var DbgMCU_CR      = 0x00000007;   // DBGMCU_CR: DBG_SLEEP, DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>
        <feature type="Timer"         n="12"      m="16"/>
        <feature type="ADC"           n="3"       m="12"/>
        <feature type="SPI"           n="6"       m="42000000"/>
        <feature type="ComOther"      n="1"                           name="SAI Interface"/>
        <feature type="I2C"           n="3"/>
        <feature type="USART"         n="4"       m="11250000"/>
        <feature type="UART"          n="4"       m="11250000"/>
        <feature type="USBOTG"        n="2"/>
        <feature type="CAN"           n="2"/>
        <feature type="SDIO"          n="1"       m="8"               name="Secure Digital IO"/>
        <feature type="ETH"           n="1"       m="100000000"/>
        <feature type="Crypto"        n="1"                           name="Hardware acceleration for AES 128, 192, 256, Triple DES, HASH (MD5, SHA-1, SHA-2) and HMAC"/>
        <feature type="Camera"        n="1"       m="14"/>
        <feature type="VCC"           n="1.70"    m="3.60"/>

