hedrickbt/TempSensor/Packages/.cache/Keil.STM32F4xx_DFP.2.8.0.pdsc
  <boards>
    <board vendor="Keil" name="MCBSTM32F400" revision="Ver 1.2" salesContact="sales.intl@keil.com" orderForm="http://www.keil.com/product/prices.asp?MCBSTM32F400=ON">
      <description>Keil MCBSTM32F400 Development Board</description>
      <image small="MDK/Boards/Keil/MCBSTM32F400/Documentation/mcbstm32f400_board.jpg" large="MDK/Boards/Keil/MCBSTM32F400/Documentation/MCBSTM32F200_F400.png"/>
      <book category="overview"  name="http://www.keil.com/mcbstm32f400/" title="MCBSTM32F400 Evaluation Board Web Page"/>
      <book category="setup"     name="Documentation/MCBSTM32F400_QSG.pdf" title="MCBSTM32F400 Quick Start Guide"/>
      <book category="schematic" name="MDK/Boards/Keil/MCBSTM32F400/Documentation/mcbstm32f400-schematics.pdf" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/Keil/MCBSTM32F400/Documentation/mcbstm32f200.chm" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F407IG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F407"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F417"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F405"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F415"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="PWR"             n="8"  m="12"      name="External Supply"/>
      <feature type="RAM"             n="1"              name="2 MByte SRAM"/>
      <feature type="ROM"             n="1"              name="8 MByte NOR Flash"/>
      <feature type="ROM"             n="1"              name="512 MByte NAND Flash"/>
      <feature type="ROM"             n="1"              name="8 kByte I2C EEPROM"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed, Host/Device, OTG"/>
      <feature type="USB"             n="1"              name="USB 2.0 High Speed, Host/Device, OTG"/>
      <feature type="CAN"             n="1"/>
      <feature type="RS232"           n="1"/>
      <feature type="ETH"             n="1"              name="10/100 Ethernet Port"/>
      <feature type="GLCD"            n="1"  m="240.320" name="2.4 inch Color QVGA TFT LCD with resistive touchscreen"/>
      <feature type="Gyro"            n="1"              name="3-axis digital output gyroscope"/>
      <feature type="Joystick"        n="1"              name="5-position Joystick"/>
      <feature type="Accelerometer"   n="1"              name="3-axis digital Accelerometer"/>
      <feature type="Poti"            n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="LineIn"          n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"         n="2"              name="Audio CODEC with Line-In/Out and Speaker/Microphone"/>
      <feature type="Other"           n="1"              name="Digital Microphone"/>
      <feature type="Camera"          n="1"              name="Digital VGA Camera"/>
      <feature type="Button"          n="4"              name="Push-Buttons for Reset, Wakeup, Tamper and User"/>
      <feature type="LED"             n="8"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="10 pin Cortex debug (0.05 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
    <board vendor="STMicroelectronics" name="STM32F401C-Discovery" revision="Rev.B.1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32F401C-DISCO">
      <description>STMicroelectronics STM32F401C-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32F401C-Discovery/Documentation/stm32f401c-disco_small.jpg" large="MDK/Boards/ST/STM32F401C-Discovery/Documentation/stm32f401c-disco_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1199/PF259098" title="STM32F401C-Discovery Web Page"/>
      <book category="setup"     name="MDK/Boards/ST/STM32F401C-Discovery/Documentation/DM00092826.pdf" title="Getting Started"/>
      <book category="setup"     name="Documentation/32F401C-DISCOVERY_QSG.pdf" title="STM32F401C-Discovery Quick Start Guide"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F401C-Discovery/Documentation/stm32f401c-disco_sch.zip" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32F401C-Discovery/Documentation/DM00093902.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32F401C-Discovery/Documentation/stm32f401c-disco_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32F401C-Discovery/Documentation/stm32f401c-disco_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F401VC"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F401"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="DIO"       n="100"            name="Extension header: 4 x 25 for LQFP100 with 2.54 mm Pitch"/>
      <feature type="USB"       n="1"              name="High-Speed USB OTG with micro-AB Connector"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="Gyro"      n="1"              name="L3GD20: motion sensor, 3-axis digital output gyroscope"/>
      <feature type="Accelerometer" n="1"          name="LSM303DLHC: 3D digital linear acceleration sensor and a 3D digital magnetic sensor"/>
      <feature type="LineOut"   n="1"              name="CS43L22: audio DAC with integrated class D speaker driver"/>
      <feature type="ConnOther" n="1"              name="JP2 (Idd) for current measurement"/>
      <feature type="ConnOther" n="1"              name="MP45DT02: audio sensor, omnidirectional digital microphone"/>
      <feature type="LED"       n="8"              name="LEDs: USB COM, 3.3 V Power, Four user, Two USB OTG LEDs"/>
      <feature type="CustomFF"  n="66" m="97"      name="Discovery Board Formfactor"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>
    <board vendor="STMicroelectronics" name="STM32F4-Discovery" revision="Rev.C.1" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32F4DISCOVERY">
      <description>STMicroelectronics STM32F4-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4_discovery_small.jpg" large="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4_discovery_large.jpg"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1199/PF252419" title="STM32F4-Discovery Web Page"/>
      <book category="setup"     name="MDK/Boards/ST/STM32F4-Discovery/Documentation/DM00037368.pdf" title="Getting Started"/>
      <book category="setup"     name="Documentation/32F4-DISCOVERY_QSG.pdf" title="STM32F4-Discovery Quick Start Guide"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4discovery_sch.zip" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32F4-Discovery/Documentation/DM00039084.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4discovery_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32F4-Discovery/Documentation/stm32f4discovery_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F407VG"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F407"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F417"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F405"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F415"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="DIO"       n="100"            name="Extension header: 4 x 25 for LQFP100 with 2.54 mm Pitch"/>
      <feature type="USB"       n="1"              name="High-Speed USB OTG with micro-AB Connector"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="Accelerometer" n="1"          name="LIS302DL or LIS3DSH ST MEMS 3-axis accelerometer"/>
      <feature type="LineOut"   n="1"              name="CS43L22: audio DAC with integrated class D speaker driver"/>
      <feature type="ConnOther" n="1"              name="JP1 (Idd) for current measurement"/>
      <feature type="ConnOther" n="1"              name="MP45DT02: audio sensor, omnidirectional digital microphone"/>
      <feature type="LED"       n="8"              name="LEDs: USB COM, 3.3 V Power, Four user, Two USB OTG LEDs"/>
      <feature type="CustomFF"  n="66" m="97"      name="Discovery Board Formfactor"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>
    <board vendor="STMicroelectronics" name="STM32F429I-Discovery" revision="Rev.B" salesContact="http://www.st.com/stonline/contactus/contacts/index.php" orderForm="https://my.st.com/esample/app?page=basket&amp;pn=STM32F429I-DISCO">
      <description>STMicroelectronics STM32F429I-Discovery Board Support and Examples</description>
      <image small="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco_small.png" large="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco.png"/>
      <book category="overview"  name="http://www.st.com/web/catalog/tools/FM116/SC959/SS1532/LN1199/PF259090" title="STM32F429I-Discovery Web Page"/>
      <book category="setup"     name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/DM00092920.pdf" title="Getting Started"/>
      <book category="setup"     name="Documentation/32F429IDISCOVERY_QSG.pdf" title="STM32F429I-Discovery Quick Start Guide"/>
      <book category="setup"     name="Documentation/STMicroelectronics_Blinky_Lab.pdf" title="STM32F429I-Discovery: Blinky Lab"/>
      <book category="schematic" name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco_sch.zip" title="Schematics"/>
      <book category="manual"    name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/DM00093903.pdf" title="User Manual"/>
      <book category="other"     name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco_gerber.zip" title="Gerber Files"/>
      <book category="other"     name="MDK/Boards/ST/STM32F429I-Discovery/Documentation/stm32f429i-disco_bom.zip" title="Bill of Materials"/>
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32F429ZI"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F427"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F429"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F437"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32F439"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="XTAL"      n="8000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="RAM"       n="1"              name="64 MBit SDRAM"/>
      <feature type="DIO"       n="128"            name="Extension header: 4 x 32 for LQFP144 with 2.54 mm Pitch"/>
      <feature type="USB"       n="1"              name="High-Speed USB OTG with micro-AB Connector"/>
      <feature type="ConnOther" n="1"              name="JP3 (Idd) for current measurement"/>
      <feature type="Button"    n="2"              name="Push-buttons: User and Reset"/>
      <feature type="Gyro"      n="1"              name="L3GD20, ST MEMS motion sensor, 3-axis digital output gyroscope"/>
      <feature type="LED"       n="6"              name="LEDs: COM, 3.3 V Power, Two user, Two USB OTG LEDs"/>
      <feature type="CustomFF"  n="66" m="119.3"   name="Discovery Board Formfactor"/>
      <feature type="GLCD"      n="1"  m="240.320" name="2.4 inch QVGA TFT LCD"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
    </board>
  </boards>

  <conditions>
    <condition id="STM32F4">
      <description>STMicroelectronics STM32F4 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32F4*"/>
    </condition>
